window.dataLoaded = false;
let title_of_eom = themeOfDEC;
const data = {
    "index_1":{
        "subtitle": "Ознакомьтесь с правилами техники безопасности при ведении технологического процесса на установке депарафинизации.",
        "step_of_popup": "Ознакомьтесь с правилами техники безопасности при ведении технологического процесса на установке депарафинизации.",
        "paragraph_1":[
            {"image": true, "image_path": "./content/first_p_img_6_2.png", "img_sign": "", "left_img": true},
            {"text": `Для исключения травмирования рабочих на установке, необходимо соблюдать <b>правила охраны труда и техники безопасности:</b>
                <p style='magin-left: 0px;'>
                    <ol>
                        <li>Во время работы использовать индивидуальные средства защиты;</li>
                        <li>Особое внимание уделять при работе с движущимися и вращающимися частями аппаратов;</li>
                        <li>Избегать прикасания к нагретым частям аппаратов;</li>
                        <li>Соблюдать правила техники безопасности.</li>
                    </ol>
                </p>
                <p>Для исключения негативного влияния на окружающую среду отслеживать:</p>
                <p>
                    <ol>
                        <li>Сбор промышленных сточных вод в систему утилизации, с предварительной очисткой;</li>
                        <li>Минимизировать и не превышать предельно-допустимых концентраций в атмосфере всех ингредиентов, которые выбрасываются на установке;</li>
                        <li>Первичная переработка и утилизация промышленных отходов.</li>
                    </ol>
                </p>`},
        ],
    },
    "index_2":{
        "subtitle": "Изучите конструкцию и принцип работы скребкового кристаллизатора.",
        "step_of_popup": "Изучите конструкцию и принцип работы скребкового кристаллизатора.",
        "paragraph_1":[
            {"text": `Скребковые кристаллизаторы применяются в процессах депарафинизациии при использовании избирательных растворителей.`},
            {"text": `Скребковые кристаллизаторы являются основным оборудованием установок депарафинизации и необходимы для охлаждения смеси сырья с растворителем с целью кристаллизации парафиновых углеводородов. Конструктивно они представляют собой теплообменники типа «труба в трубе».`},
            {"text": `<b class='blue_header'>Принцип работы кристаллизатора:</b> суспензия сырья проходит по внутренним трубам, охлаждается и образует тонкий слой суспензии, который прилегает к внутренней трубе. Затем этот слой удаляется скребками. Снятый слой перемешивается с теплой суспензией.`},
        ],
        "paragraph_2":[
            {"image": true, "image_path": "./content/second_p_img_6_2.png", "img_sign": "Конструкция скребкового кристаллизатора", "left_img": true},
        ],
        "paragraph_3":[
            {"text": `В таких кристаллизаторах может быть разное количество секций, каждая из них состоит из внутренней и наружной трубы.`},
        ],
    },
    "index_3":{
        "subtitle": "Сопоставьте элемент конструкции скребкового кристаллизатора с его названием.",
        "step_of_popup": "Сопоставьте элемент конструкции скребкового кристаллизатора с его названием.",
        "test":[
            {"type": 3},
            {"image": true, "image_path": "./content/third_p_img_6_2.png"},
            {"answers": [
                "Наружная труба",
                "Внутренняя труба",
                "Хладагент",
                "Скребок",
                "Суспензия сырья",
                "Слой твердой фазы"
            ]}
        ],
    },
    "index_4":{
        "subtitle": "Изучите конструкцию и принцип работы кристаллизатора смешивания.",
        "step_of_popup": "Изучите конструкцию и принцип работы кристаллизатора смешивания.",
        "paragraph_1":[
            {"text": `Принцип работы заключается в том, кристаллизация осуществляется за счет предварительно охлажденного растворителя, который порциями смешивается с сырьем.`},
        ],
        "paragraph_2":[
            {"image": true, "image_path": "./content/fourth_p_img_6_2.png", "img_sign": "Конструкция кристаллизатора смешивания", "left_img": true},
        ],
        "paragraph_3":[
            {"text": `Кристаллизатор разделен перегородками (4) на секции. В каждую секцию аппарата подается охлажденный растворитель (II).`},
            {"text": `В нижнюю часть кристаллизатора подается сырье (I) и порция растворителя, при помощи перемешивающего устройства (3) сырье и растворитель контактируют между собой, для лучшего перемешивания имеются отражатели (2), которые прикреплены к корпусу (1) аппарата. Суспензия (III) твердых углеводородов выводится сверху кристаллизатора.`},
            {"text": `В таких кристаллизаторах образуются крупные кристаллы, а следственно увеличивается скорость разделения.`},
        ],
    },
    "index_5": {
        "subtitle": "Определите правильное расположение движения фаз в кристаллизаторе смешивания.",
        "step_of_popup": "Определите правильное расположение движения фаз в кристаллизаторе смешивания.",
        "test": [{
            "type": 2
        }, {
            "description": "Название сырья с ответствующим ему номером:"
        }, {
            "test_with_text_2": "1) {=Сырье,сырье} <br> 2) {=Суспензия,суспензия} <br> 3) {=Растворитель,растворитель} <br> 4) {=Растворитель,растворитель} <br> 5) {=Растворитель,растворитель} <br> 6) {=Растворитель,растворитель} <br> 7) {=Растворитель,растворитель} <br> 8) {=Растворитель,растворитель} <br>"
        }, {
            "image": true,
            "image_path": "./content/fifth_p_img_6_2.png"
        }],
    },
    "index_6": {
        "subtitle": "Изучите конструкцию и принцип работы вакуумных фильтров.",
        "step_of_popup": "Изучите конструкцию и принцип работы вакуумных фильтров.",
        "paragraph_1":[
            {"text": `<b class='blue_header'>Фильтры</b> – это аппараты, которые используются для отделения кристаллов твердых углеводородов из раствора депрафинизата.`},
            {"text": `Фильтр состоит из вращающегося барабана, который обтянут специальной тканью (фильтровальной) и распределительного устройства.`},
            {"text": `Охлажденный раствор подается в фильтр. За счет вакуума, который создается в секциях барабана происходит фильтрование. Раствор депарафинизата проходит через ткань, а кристаллы парафина остаются на поверхности ткани. Далее образовавшийся на фильтрующей поверхности осадок промывается растворителем.`},
            {"text": `Из-за вакуума который поддерживается внутри секции, растворитель просасывается через слой твердых углеводородов и тем самым растворяя в нем масло. Промытый осадок отдувается инертным газом.`},
        ],
        "paragraph_2":[
            {"image": true, "image_path": "./content/sixth_p_img_6_2.png", "img_sign": "Схема вакуумного фильтра непрерывного действия", "left_img": true},
        ],
    },
    "index_7":{
        "subtitle": "Сопоставьте по схеме элементы конструкции и их названия.",
        "step_of_popup": "Сопоставьте по схеме элементы конструкции и их названия.",
        "test": [            
            {"type": 3},
            {"image": true, "image_path": "./content/seventh_p_img_6_2.png"},
            {"answers": [
                "Вакуумный фильтр",
                "Газгольдер",
                "Вакуумный приемник",
                "Вакуумный компрессор"
            ]}
        ],
    },
    "index_8":{
        "subtitle": "Соедините по схеме номер трубопровода и название транспортируемой среды.",
        "step_of_popup": "Соедините по схеме номер трубопровода и название транспортируемой среды.",
        "test": [            
            {"type": 3},
            {"image": true, "image_path": "./content/eighth_p_img_6_2.png"},
            {"answers": [
                "Суспензия сырья в растворителе",
                "Растворитель",
                "Раствор депарафинизированного масла",
                "Раствор промывной",
                "Раствор гача или петролатума",
                "Инертный газ",
                "Фильтрат горячей отмывки"
            ]}
        ],
    },
    "index_9":{
        "subtitle": "Изучите разновидности процесса депарафинизации экстрактной кристаллизацией.",
        "step_of_popup": "Изучите разновидности процесса депарафинизации экстрактной кристаллизацией.",
        "paragraph_1":[
            {"text": `При производстве нефтяных масел используются такие разновидности процессов депарафинизации, как депарафинизация пропаном, процесс «Эделеану» и процесс «Дилчил». У каждого из этих процессов имеются свои особенности, которые определяют их применение и использование специальных растворителей.`},
        ],
        "paragraph_2":[
            {"image": true, "image_path": "./content/nineth_p_img_6_2.png", "img_sign": " ", "left_img": true},
        ],
    },
    "index_10":{
        "subtitle": "Установите соответствие между разновидностью процесса депарафинизации и его характеристиками.",
        "step_of_popup": "Установите соответствие между разновидностью процесса депарафинизации и его характеристиками.",
        "test": [{
            "type": 7
        }, {
            "anwserArr2": ['Выше скорость охлаждения', 'Небольшая кратность', 'Низкая скорость фильтрования', 'Низкий температурный градиент', 'Нет системы инертного газа', 'Высокий выход депарафинизата', 'Система обезвоживания растворителя']
        }, {
            "answersInCol": [['Выше скорость охлаждения', 'Небольшая кратность', 'Низкая скорость фильтрования'], ['Низкий температурный градиент', 'Нет системы инертного газа'], ['Высокий выход депарафинизата', 'Система обезвоживания растворителя']]
        }, {
            "columns": ['Депарафинизация пропаном', 'Процесс «Эделеану»', 'Процесс «Дилчил»']
        }],
    },
    "index_11":{
        "subtitle": "Результаты",
        "step_of_popup": "Результаты",
        "result":[]
    },
}
window.dataLoaded = true;